import React, { useState, useEffect } from 'react'
import Header from '../components/Header'
import { getText } from '../locales'
import axios from 'axios'
import { API_PATH } from '../tools/constats'

const Public = () => {

    const [publicData, setPublicData] = useState([]);

    useEffect(() => {
        axios.get(`${API_PATH}order/politics`)
            .then((response) => {
                setPublicData(response.data)
            })
    }, [])

    console.log(publicData)

    return (

        <>
            <Header />
            <div className="Public">
                <div className="public_container">
                    <div className="row">
                        <div className="col-12">
                            <div className="pub_link">
                                <a href="" className="pub_a">{getText("header_6")} /</a>
                                <div className="pub_a_h">
                                    Публичная оферта
                                </div>
                            </div>
                        </div>
                        <div className="col-12">
                            <div className="pub_name">
                                Публичная оферта
                            </div>

                            <div>
                                {publicData && publicData.map((public_data) => {
                                    return (
                                        <div className='pub_container' >
                                            <p className="pub_h"> {public_data.title}</p>
                                            <div className="pub_p" dangerouslySetInnerHTML={{ __html: public_data.description }} />

                                        </div>
                                    )
                                })

                                }
                                {/* <div className="pub_p">
                                    1.1. Настоящая политика конфиденциальности (далее-“политика”) разработана ООО «Альфа-Софт” и определяет порядок получения, сбора, хранения, обработки, использования, обеспечения защиты и раскрытия персональных данных пользователей портала (далее - «данные»).
                                    Данные-прямо или косвенно относится к любой информации, относящейся к конкретному пользователю. Это могут быть: имя, фамилия, адрес электронной почты, номер телефона, район проживания, ip-адрес, информация об используемых пользователем устройствах (компьютер, тип браузера, операционная система мобильного устройства), сообщения (информация, содержащаяся в переписке пользователей и других лиц, а также в переписке с администрацией портала) и собственные предпочтения пользователя с другой контактной информацией, предоставляемой через регистрационную форму и/или при заполнении своего профиля на портале, Сообщение и / или письменная обратная связь, предоставленная порталу, или информация, полученная в ходе устного общения между пользователями и администрацией портала.
                                    Обработка данных относится к любому действию, совершаемому сообществом с данными, включая, помимо прочего: разрешение, предоставление, распространение, сбор, систематизацию, хранение, сбор, запись, передачу, блокировку, удаление, уточнение, обновление и/или изменение, обезличивание и другие использование методов понятно.
                                    1.2. Когда пользователь регистрируется на портале, вводит свои личные данные и/или иным образом предоставляет эти данные Smartshops.uz при совершении каких — либо действий на сайте и / или использовании любой части сайта и / или выражении согласия путем активации кнопки» регистрация «на сайте-он выражает свое согласие с положениями настоящей Политики и подписывает " Альфа -Soft позволяет LLC обрабатывать свои данные.
                                    Пользователи могут самостоятельно размещать свои данные на портале или предоставлять их по телефонным каналам и/или путем отправки на электронную почту и/или почтовый адрес компании, или данные могут быть предоставлены из других источников (в соответствии с пунктом 3 настоящей Политики), таких как отзывы пользователей (оценки, комментарии, подтверждение информации) или из третьих лиц в процессе разрешения споров. претензии, представленные отдельными лицами, информация в жалобах и/или информация из открытых источников в сети Интернет.
                                    1.3. Если пользователь не согласен с условиями настоящей Политики, smart-market.uz не имеет права использовать свой веб-сайт.
                                    1.4. Признает, что третьи лица могут получить несанкционированный доступ к учетной записи и данным пользователя, если пользователь пренебрегает безопасностью и защитой своих данных и данных авторизации (пароль, логин). Общество не несет ответственности за ущерб, причиненный таким доступом.
                                </div>
                                <div className="pub_h">
                                    2. Какие личные данные могут быть собраны
                                </div>
                                <div className="pub_p">
                                    Сообщество может собирать следующую информацию:
                                    имя, фамилия, отчество, дата рождения, пол, семейное положение, информация об авторизованном лице компании, название компании, реквизиты компании, контактные номера, адрес электронной почты, местонахождение компании, другая контактная информация по усмотрению пользователя; Для обслуживания пользователей портала, общения с пользователями, включая информацию об учетной записи пользователя, которая необходима при обращении пользователя в службу поддержки портала, включая номер телефона, адрес электронной почты, логин и пароль, другие данные; договоры о приеме публичной оферты, размещенные на портале, и/или оказании дополнительных услуг на портале информация, предоставляемая пользователями сообществу при заключении договоров на оказание услуг путем заключения; Информация, которая будет необходима для общения между пользователями портала, в том числе для совершения и подтверждения операций между продавцами и покупателями, получения и отправки сообщений, комментариев, размещения комментариев, осуществления платежей; Информация об устройствах, используемых пользователем, информация о веб-сайтах пользователей и/или их мобильные данные (если пользователь использует мобильное приложение), такие как: IP-адрес, дата и время, когда пользователь использует портал, информация о программном обеспечении, а также об используемом интернет-браузере, информация об операционной системе мобильного устройства, информация об использовании устройств пользователем и т. д. данные о производительности, индивидуальные идентификаторы устройств, используемых пользователями; Информация, полученная в результате проведения обществом и / или уполномоченными обществом третьими лицами различных опросов о совершенствовании оказания услуг пользователям; информация, полученная в результате маркетинговой деятельности, осуществляемой обществом; информация, размещенная пользователями на основе результатов оказанных им услуг, замечаний, комментариев, обращений в службу поддержки, жалоб, претензий и других обращений.
                                </div>
                                <div className="pub_h">
                                    3. Цели и использование обработки данных
                                </div>
                                <div className="pub_p">
                                    Сообщество использует и обрабатывает данные для следующих целей:
                                    Осуществление функций, полномочий и обязанностей, возложенных на общество в соответствии с действующим законодательством Узбекистана; Идентификация клиента в качестве пользователя портала с целью установления контакта с пользователями, включая предоставление услуг, отчетность, создание и реализацию бонусных программ, программ лояльности, рассылку рассылок по почте, электронной почте, включая коммерческие предложения, уведомления о рекламных акциях и другие smart-market.uz новости, повышение качества услуг, формирование рейтингов, анализ активности пользователей, поиск по ключевым словам, управление трафиком на портале, предпочтения пользователей, осуществлять исследовательскую и аналитическую деятельность, а также обеспечивать соблюдение пользователями условий пользовательского соглашения и smart-market.uz обеспечение соблюдения правил размещения информации на сайте. Условия обработки и хранения данных определяются исходя из целей обработки данных, а также на условиях, указанных в договорах с пользователями, в соответствии с требованиями действующего законодательства Узбекистана.
                                    Условия предоставления доступа к данным
                                    Общество оставляет за собой право в соответствии с требованиями действующего законодательства Узбекистана обмениваться информацией с государственными органами в следующих целях: предотвращение мошенничества на портале, разрешение споров и выявление обстоятельств, которые могут привести к нарушению действующего законодательства, а также в случае выявления компанией противоправных действий пользователей портала и/или поступления претензий, жалоб, обращений от третьих лиц. если упадет.
                                </div>
                                <div className="pub_h">
                                    Защита данных
                                </div>
                                <div className="pub_p">
                                    Общество применяет при обработке данных все необходимые технические, организационные, правовые меры для защиты информации от незаконного и / или несанкционированного использования, включая изменение, удаление, предоставление, распространение, а также иные противоправные действия.
                                    Общество на постоянной основе осуществляет контроль за принимаемыми мерами по обеспечению безопасности.
                                </div>
                                <div className="pub_h">
                                    ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
                                </div>
                                <div className="pub_p">
                                    Общество оставляет за собой право изменять условия настоящей Политики в любое время. В этом случае обновленная версия будет размещена на следующей странице: :
                                    smarthops.uz
                                    Если пользователь не согласен с изменениями, он обязуется немедленно прекратить любое взаимодействие с порталом.
                                    ООО” Альфа-Софт " не несет ответственности за убытки или убытки, причиненные пользователем или третьими лицами в результате неправильного понимания или непонимания условий настоящей Политики.
                                    Если какое-либо положение настоящей политики, включая любое предложение, пункт или его часть, будет признано противоречащим или недействительным действующему законодательству Узбекистана, это не повлияет на остальные положения, которые полностью останутся в силе и продолжат действовать в полном объеме и могут быть выполнены без каких-либо дальнейших действий со стороны утратившего силу правила или сторон правило о недействительности считается измененным, исправленным в той мере, в какой это необходимо для обеспечения его действительности и возможности реализации.
                                </div> */}
                            </div>


                        </div>
                    </div>
                </div>
            </div>
        </>
    )
}

export default Public